UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32h7a2_pinmux.h
	((gpio == PE06) && (func == PSSI_D7_FUNC             )) ? 13 : \
	((gpio == PE06) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PE06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE07) && (func == DFSDM1_DATIN2_FUNC       )) ?  3 : \
	((gpio == PE07) && (func == UART7_RX_FUNC            )) ?  7 : \
	((gpio == PE07) && (func == OCTOSPIM_P1_IO4_FUNC     )) ? 10 : \
	((gpio == PE07) && (func == FMC_D4_FUNC              )) ? 12 : \
	((gpio == PE07) && (func == FMC_DA4_FUNC             )) ? 12 : \
	((gpio == PE07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == DFSDM1_CKIN2_FUNC        )) ?  3 : \
	((gpio == PE08) && (func == UART7_TX_FUNC            )) ?  7 : \
	((gpio == PE08) && (func == OCTOSPIM_P1_IO5_FUNC     )) ? 10 : \
	((gpio == PE08) && (func == FMC_D5_FUNC              )) ? 12 : \
	((gpio == PE08) && (func == FMC_DA5_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == COMP2_OUT_FUNC           )) ? 13 : \
	((gpio == PE08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == DFSDM1_CKOUT_FUNC        )) ?  3 : \
	((gpio == PE09) && (func == UART7_DE_FUNC            )) ?  7 : \
	((gpio == PE09) && (func == UART7_RTS_FUNC           )) ?  7 : \
	((gpio == PE09) && (func == OCTOSPIM_P1_IO6_FUNC     )) ? 10 : \
	((gpio == PE09) && (func == FMC_D6_FUNC              )) ? 12 : \
	((gpio == PE09) && (func == FMC_DA6_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == DFSDM1_DATIN4_FUNC       )) ?  3 : \
	((gpio == PE10) && (func == UART7_CTS_FUNC           )) ?  7 : \
	((gpio == PE10) && (func == OCTOSPIM_P1_IO7_FUNC     )) ? 10 : \
	((gpio == PE10) && (func == FMC_D7_FUNC              )) ? 12 : \
	((gpio == PE10) && (func == FMC_DA7_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == DFSDM1_CKIN4_FUNC        )) ?  3 : \
	((gpio == PE11) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PE11) && (func == OCTOSPIM_P1_NCS_FUNC     )) ? 11 : \
	((gpio == PE11) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PE11) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PE11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == DFSDM1_DATIN5_FUNC       )) ?  3 : \
	((gpio == PE12) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == COMP1_OUT_FUNC           )) ? 13 : \
	((gpio == PE12) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PE12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == DFSDM1_CKIN5_FUNC        )) ?  3 : \
	((gpio == PE13) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE13) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == COMP2_OUT_FUNC           )) ? 13 : \
	((gpio == PE13) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PE13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PE14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == USART10_CK_FUNC          )) ? 11 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == TIM1_BKIN_COMP1_FUNC     )) ? 13 : \
	((gpio == PE15) && (func == TIM1_BKIN_COMP2_FUNC     )) ? 13 : \
	((gpio == PE15) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PE15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == OCTOSPIM_P2_IO0_FUNC     )) ?  9 : \
	((gpio == PF00) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == OCTOSPIM_P2_IO1_FUNC     )) ?  9 : \
	((gpio == PF01) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == OCTOSPIM_P2_IO2_FUNC     )) ?  9 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
	((gpio == PF02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF03) && (func == OCTOSPIM_P2_IO3_FUNC     )) ?  9 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF04) && (func == OCTOSPIM_P2_CLK_FUNC     )) ?  9 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF05) && (func == OCTOSPIM_P2_NCLK_FUNC    )) ?  9 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF06) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PF06) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ?  6 : \
	((gpio == PF06) && (func == UART7_RX_FUNC            )) ?  7 : \
	((gpio == PF06) && (func == OCTOSPIM_P1_IO3_FUNC     )) ? 10 : \
	((gpio == PF06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF07) && (func == TIM17_CH1_FUNC           )) ?  1 : \
	((gpio == PF07) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ?  6 : \
	((gpio == PF07) && (func == UART7_TX_FUNC            )) ?  7 : \
	((gpio == PF07) && (func == OCTOSPIM_P1_IO2_FUNC     )) ? 10 : \
	((gpio == PF07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF08) && (func == TIM16_CH1N_FUNC          )) ?  1 : \
	((gpio == PF08) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ?  6 : \
	((gpio == PF08) && (func == UART7_DE_FUNC            )) ?  7 : \
	((gpio == PF08) && (func == UART7_RTS_FUNC           )) ?  7 : \
	((gpio == PF08) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PF08) && (func == OCTOSPIM_P1_IO0_FUNC     )) ? 10 : \
	((gpio == PF08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF09) && (func == TIM17_CH1N_FUNC          )) ?  1 : \
	((gpio == PF09) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ?  6 : \
	((gpio == PF09) && (func == UART7_CTS_FUNC           )) ?  7 : \
	((gpio == PF09) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PF09) && (func == OCTOSPIM_P1_IO1_FUNC     )) ? 10 : \
	((gpio == PF09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF10) && (func == TIM16_BKIN_FUNC          )) ?  1 : \
	((gpio == PF10) && (func == SAI1_D3_FUNC             )) ?  2 : \
	((gpio == PF10) && (func == PSSI_D15_FUNC            )) ?  4 : \
	((gpio == PF10) && (func == OCTOSPIM_P1_CLK_FUNC     )) ?  9 : \
	((gpio == PF10) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PF10) && (func == PSSI_D11_FUNC            )) ? 13 : \
	((gpio == PF10) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PF10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF11) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF11) && (func == OCTOSPIM_P1_NCLK_FUNC    )) ?  9 : \
	((gpio == PF11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PF11) && (func == FMC_SDNRAS_FUNC          )) ? 12 : \
	((gpio == PF11) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PF11) && (func == PSSI_D12_FUNC            )) ? 13 : \
	((gpio == PF11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF12) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  9 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF13) && (func == DFSDM1_DATIN6_FUNC       )) ?  3 : \
	((gpio == PF13) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF14) && (func == DFSDM1_CKIN6_FUNC        )) ?  3 : \
	((gpio == PF14) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF15) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG00) && (func == OCTOSPIM_P2_IO4_FUNC     )) ?  9 : \
	((gpio == PG00) && (func == UART9_RX_FUNC            )) ? 11 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG01) && (func == OCTOSPIM_P2_IO5_FUNC     )) ?  9 : \
	((gpio == PG01) && (func == UART9_TX_FUNC            )) ? 11 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG02) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PG02) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 11 : \
	((gpio == PG02) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 11 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG03) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PG03) && (func == TIM8_BKIN2_COMP1_FUNC    )) ? 11 : \
	((gpio == PG03) && (func == TIM8_BKIN2_COMP2_FUNC    )) ? 11 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG04) && (func == TIM1_BKIN2_FUNC          )) ?  1 : \
	((gpio == PG04) && (func == TIM1_BKIN2_COMP1_FUNC    )) ? 11 : \
	((gpio == PG04) && (func == TIM1_BKIN2_COMP2_FUNC    )) ? 11 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_BA0_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG05) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_BA1_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG06) && (func == TIM17_BKIN_FUNC          )) ?  1 : \
	((gpio == PG06) && (func == OCTOSPIM_P1_NCS_FUNC     )) ? 10 : \
	((gpio == PG06) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG06) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PG06) && (func == PSSI_D12_FUNC            )) ? 13 : \
	((gpio == PG06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PG06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG07) && (func == SAI1_MCLK_A_FUNC         )) ?  6 : \
	((gpio == PG07) && (func == USART6_CK_FUNC           )) ?  7 : \
	((gpio == PG07) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  9 : \
	((gpio == PG07) && (func == FMC_INT_FUNC             )) ? 12 : \
	((gpio == PG07) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PG07) && (func == PSSI_D13_FUNC            )) ? 13 : \
	((gpio == PG07) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PG07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG08) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PG08) && (func == I2S6_WS_FUNC             )) ?  5 : \
	((gpio == PG08) && (func == SPI6_NSS_FUNC            )) ?  5 : \
	((gpio == PG08) && (func == USART6_DE_FUNC           )) ?  7 : \
	((gpio == PG08) && (func == USART6_RTS_FUNC          )) ?  7 : \
	((gpio == PG08) && (func == SPDIFRX_IN3_FUNC         )) ?  8 : \
	((gpio == PG08) && (func == FMC_SDCLK_FUNC           )) ? 12 : \
	((gpio == PG08) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PG08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG09) && (func == I2S1_SDI_FUNC            )) ?  5 : \
	((gpio == PG09) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PG09) && (func == USART6_RX_FUNC           )) ?  7 : \
	((gpio == PG09) && (func == SPDIFRX_IN4_FUNC         )) ?  8 : \
	((gpio == PG09) && (func == OCTOSPIM_P1_IO6_FUNC     )) ?  9 : \
	((gpio == PG09) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PG09) && (func == SDMMC2_D0_FUNC           )) ? 11 : \
	((gpio == PG09) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PG09) && (func == PSSI_RDY_FUNC            )) ? 13 : \
	((gpio == PG09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG10) && (func == OCTOSPIM_P2_IO6_FUNC     )) ?  3 : \
	((gpio == PG10) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PG10) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PG10) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PG10) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PG10) && (func == SDMMC2_D1_FUNC           )) ? 11 : \
	((gpio == PG10) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG10) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PG10) && (func == PSSI_D2_FUNC             )) ? 13 : \
	((gpio == PG10) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PG10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG11) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PG11) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PG11) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PG11) && (func == SPDIFRX_IN1_FUNC         )) ?  8 : \
	((gpio == PG11) && (func == OCTOSPIM_P2_IO7_FUNC     )) ?  9 : \
	((gpio == PG11) && (func == SDMMC2_D2_FUNC           )) ? 10 : \
	((gpio == PG11) && (func == USART10_RX_FUNC          )) ? 11 : \
	((gpio == PG11) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PG11) && (func == PSSI_D3_FUNC             )) ? 13 : \
	((gpio == PG11) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PG11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG12) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PG12) && (func == OCTOSPIM_P2_NCS_FUNC     )) ?  3 : \
	((gpio == PG12) && (func == I2S6_SDI_FUNC            )) ?  5 : \
	((gpio == PG12) && (func == SPI6_MISO_FUNC           )) ?  5 : \
	((gpio == PG12) && (func == USART6_DE_FUNC           )) ?  7 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  7 : \
	((gpio == PG12) && (func == SPDIFRX_IN2_FUNC         )) ?  8 : \
	((gpio == PG12) && (func == LTDC_B4_FUNC             )) ?  9 : \
	((gpio == PG12) && (func == SDMMC2_D3_FUNC           )) ? 10 : \
	((gpio == PG12) && (func == USART10_TX_FUNC          )) ? 11 : \
	((gpio == PG12) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PG12) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PG12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG13) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PG13) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PG13) && (func == I2S6_CK_FUNC             )) ?  5 : \
	((gpio == PG13) && (func == SPI6_SCK_FUNC            )) ?  5 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  7 : \
	((gpio == PG13) && (func == USART6_NSS_FUNC          )) ?  7 : \
	((gpio == PG13) && (func == SDMMC2_D6_FUNC           )) ? 10 : \
	((gpio == PG13) && (func == USART10_CTS_FUNC         )) ? 11 : \
	((gpio == PG13) && (func == USART10_NSS_FUNC         )) ? 11 : \
	((gpio == PG13) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PG13) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PG13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG14) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PG14) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PG14) && (func == I2S6_SDO_FUNC            )) ?  5 : \
	((gpio == PG14) && (func == SPI6_MOSI_FUNC           )) ?  5 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  7 : \
	((gpio == PG14) && (func == OCTOSPIM_P1_IO7_FUNC     )) ?  9 : \
	((gpio == PG14) && (func == SDMMC2_D7_FUNC           )) ? 10 : \
	((gpio == PG14) && (func == USART10_DE_FUNC          )) ? 11 : \
	((gpio == PG14) && (func == USART10_RTS_FUNC         )) ? 11 : \
	((gpio == PG14) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PG14) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PG14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  7 : \
	((gpio == PG15) && (func == USART6_NSS_FUNC          )) ?  7 : \
	((gpio == PG15) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  9 : \
	((gpio == PG15) && (func == USART10_CK_FUNC          )) ? 11 : \
	((gpio == PG15) && (func == FMC_SDNCAS_FUNC          )) ? 12 : \
	((gpio == PG15) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PG15) && (func == PSSI_D13_FUNC            )) ? 13 : \
	((gpio == PG15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PH02) && (func == OCTOSPIM_P1_IO4_FUNC     )) ?  9 : \
	((gpio == PH02) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PH02) && (func == FMC_SDCKE0_FUNC          )) ? 12 : \
	((gpio == PH02) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PH02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH03) && (func == OCTOSPIM_P1_IO5_FUNC     )) ?  9 : \
	((gpio == PH03) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PH03) && (func == FMC_SDNE0_FUNC           )) ? 12 : \
	((gpio == PH03) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PH03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PH04) && (func == LTDC_G5_FUNC             )) ?  9 : \
	((gpio == PH04) && (func == USB_OTG_HS_ULPI_NXT_FUNC )) ? 10 : \
	((gpio == PH04) && (func == PSSI_D14_FUNC            )) ? 13 : \
	((gpio == PH04) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PH04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH05) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PH05) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PH05) && (func == FMC_SDNWE_FUNC           )) ? 12 : \
	((gpio == PH05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH06) && (func == TIM12_CH1_FUNC           )) ?  2 : \
	((gpio == PH06) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PH06) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PH06) && (func == FMC_SDNE1_FUNC           )) ? 12 : \
	((gpio == PH06) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PH06) && (func == PSSI_D8_FUNC             )) ? 13 : \
	((gpio == PH06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PH07) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PH07) && (func == FMC_SDCKE1_FUNC          )) ? 12 : \
	((gpio == PH07) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PH07) && (func == PSSI_D9_FUNC             )) ? 13 : \
	((gpio == PH07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH08) && (func == TIM5_ETR_FUNC            )) ?  2 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == FMC_D16_FUNC             )) ? 12 : \
	((gpio == PH08) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PH08) && (func == PSSI_DE_FUNC             )) ? 13 : \
	((gpio == PH08) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PH08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH09) && (func == TIM12_CH2_FUNC           )) ?  2 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == FMC_D17_FUNC             )) ? 12 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == PSSI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PH09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PH10) && (func == FMC_D18_FUNC             )) ? 12 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == PSSI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PH10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PH11) && (func == FMC_D19_FUNC             )) ? 12 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == PSSI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PH11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PH12) && (func == FMC_D20_FUNC             )) ? 12 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == PSSI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PH12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PH13) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PH13) && (func == FMC_D21_FUNC             )) ? 12 : \
	((gpio == PH13) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PH13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PH14) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
