UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32h7a2_pinmux.h
	((gpio == PH14) && (func == FMC_D22_FUNC             )) ? 12 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == PSSI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PH14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == FMC_D23_FUNC             )) ? 12 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == PSSI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PH15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == FMC_D24_FUNC             )) ? 12 : \
	((gpio == PI00) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PI00) && (func == PSSI_D13_FUNC            )) ? 13 : \
	((gpio == PI00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PI00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI01) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PI01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == TIM8_BKIN2_COMP1_FUNC    )) ? 11 : \
	((gpio == PI01) && (func == TIM8_BKIN2_COMP2_FUNC    )) ? 11 : \
	((gpio == PI01) && (func == FMC_D25_FUNC             )) ? 12 : \
	((gpio == PI01) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PI01) && (func == PSSI_D8_FUNC             )) ? 13 : \
	((gpio == PI01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PI01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == I2S2_SDI_FUNC            )) ?  5 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == FMC_D26_FUNC             )) ? 12 : \
	((gpio == PI02) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PI02) && (func == PSSI_D9_FUNC             )) ? 13 : \
	((gpio == PI02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PI02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == I2S2_SDO_FUNC            )) ?  5 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == FMC_D27_FUNC             )) ? 12 : \
	((gpio == PI03) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PI03) && (func == PSSI_D10_FUNC            )) ? 13 : \
	((gpio == PI03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == SAI2_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PI04) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 11 : \
	((gpio == PI04) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 11 : \
	((gpio == PI04) && (func == FMC_NBL2_FUNC            )) ? 12 : \
	((gpio == PI04) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PI04) && (func == PSSI_D5_FUNC             )) ? 13 : \
	((gpio == PI04) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PI04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == SAI2_SCK_A_FUNC          )) ? 10 : \
	((gpio == PI05) && (func == FMC_NBL3_FUNC            )) ? 12 : \
	((gpio == PI05) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PI05) && (func == PSSI_RDY_FUNC            )) ? 13 : \
	((gpio == PI05) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PI05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == SAI2_SD_A_FUNC           )) ? 10 : \
	((gpio == PI06) && (func == FMC_D28_FUNC             )) ? 12 : \
	((gpio == PI06) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PI06) && (func == PSSI_D6_FUNC             )) ? 13 : \
	((gpio == PI06) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PI06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == SAI2_FS_A_FUNC           )) ? 10 : \
	((gpio == PI07) && (func == FMC_D29_FUNC             )) ? 12 : \
	((gpio == PI07) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PI07) && (func == PSSI_D7_FUNC             )) ? 13 : \
	((gpio == PI07) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PI07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI09) && (func == OCTOSPIM_P2_IO0_FUNC     )) ?  3 : \
	((gpio == PI09) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PI09) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PI09) && (func == FMC_D30_FUNC             )) ? 12 : \
	((gpio == PI09) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI10) && (func == OCTOSPIM_P2_IO1_FUNC     )) ?  3 : \
	((gpio == PI10) && (func == FMC_D31_FUNC             )) ? 12 : \
	((gpio == PI10) && (func == PSSI_D14_FUNC            )) ? 13 : \
	((gpio == PI10) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI11) && (func == OCTOSPIM_P2_IO2_FUNC     )) ?  3 : \
	((gpio == PI11) && (func == LTDC_G6_FUNC             )) ?  9 : \
	((gpio == PI11) && (func == USB_OTG_HS_ULPI_DIR_FUNC )) ? 10 : \
	((gpio == PI11) && (func == PSSI_D15_FUNC            )) ? 13 : \
	((gpio == PI11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI12) && (func == OCTOSPIM_P2_IO3_FUNC     )) ?  3 : \
	((gpio == PI12) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI13) && (func == OCTOSPIM_P2_CLK_FUNC     )) ?  3 : \
	((gpio == PI13) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI14) && (func == OCTOSPIM_P2_NCLK_FUNC    )) ?  3 : \
	((gpio == PI14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PI14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI15) && (func == LTDC_G2_FUNC             )) ?  9 : \
	((gpio == PI15) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PI15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ00) && (func == LTDC_R7_FUNC             )) ?  9 : \
	((gpio == PJ00) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PJ00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ01) && (func == OCTOSPIM_P2_IO4_FUNC     )) ?  3 : \
	((gpio == PJ01) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PJ01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ02) && (func == OCTOSPIM_P2_IO5_FUNC     )) ?  3 : \
	((gpio == PJ02) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PJ02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ03) && (func == UART9_DE_FUNC            )) ? 11 : \
	((gpio == PJ03) && (func == UART9_RTS_FUNC           )) ? 11 : \
	((gpio == PJ03) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PJ03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ04) && (func == UART9_CTS_FUNC           )) ? 11 : \
	((gpio == PJ04) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PJ04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ05) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PJ05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PJ06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PJ06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ07) && (func == DEBUG_TRGIN_FUNC         )) ?  0 : \
	((gpio == PJ07) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PJ07) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PJ07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ08) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PJ08) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PJ08) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PJ08) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PJ08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ09) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PJ09) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PJ09) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PJ09) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PJ09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PJ10) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PJ10) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PJ10) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PJ10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PJ11) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PJ11) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PJ11) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PJ11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ12) && (func == DEBUG_TRGOUT_FUNC        )) ?  0 : \
	((gpio == PJ12) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PJ12) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PJ12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ13) && (func == LTDC_B4_FUNC             )) ?  9 : \
	((gpio == PJ13) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PJ13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ14) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PJ14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ15) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PJ15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK00) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PK00) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PK00) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PK00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PK00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK01) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PK01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PK01) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PK01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PK01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK02) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PK02) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PK02) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 10 : \
	((gpio == PK02) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 10 : \
	((gpio == PK02) && (func == TIM1_BKIN_COMP1_FUNC     )) ? 11 : \
	((gpio == PK02) && (func == TIM1_BKIN_COMP2_FUNC     )) ? 11 : \
	((gpio == PK02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PK02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK03) && (func == OCTOSPIM_P2_IO6_FUNC     )) ?  3 : \
	((gpio == PK03) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PK03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK04) && (func == OCTOSPIM_P2_IO7_FUNC     )) ?  3 : \
	((gpio == PK04) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PK04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK05) && (func == OCTOSPIM_P2_NCS_FUNC     )) ?  3 : \
	((gpio == PK05) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PK05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK06) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  3 : \
	((gpio == PK06) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PK06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK07) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PK07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	AF_NO_SUCH_PINFUNC)

